#type:
#ეს ატრიბუტი განსაზღვრავს HTML ელემენტის ტიპს, მაგალითად <input> ელემენტისთვის. type ატრიბუტის მნიშვნელობით შეიძლება განისაზღვროს, რომ ელემენტი იქნება ტექსტური ველი, ჩეკბოქსი, რადიო ღილაკი ან სხვა ტიპის ფორმის ელემენტი. მაგალითად, <input type="text"> ქმნის ტექსტურ ველს, ხოლო <input type="checkbox"> — ჩეკბოქსს.

# name:
#name ატრიბუტი ხშირად გამოიყენება ფორმის ელემენტებში, რათა გააუმჯობესოს მონაცემების გადაცემა. როდესაც ფორმა ივსება და იგზავნება, name ატრიბუტი განასხვავებს თითოეული ველის მონაცემებს. მაგალითად, <input type="text" name="username"> — როდესაც ფორმა გაიგზავნება, ამ ელემენტის მნიშვნელობა იქნება დაკავშირებული "username"-თან.

# value:
#value ატრიბუტი განსაზღვრავს ფორმის ელემენტის დაწყებითი მნიშვნელობას. მაგალითად, <input type="text" value="Hello"> — ამ შემთხვევაში, ველი "Hello"-ით იქნება გაჯერებული წინასწარ. ასევე გამოიყენება როგორც წინა შეყვანილი მონაცემების განსაზღვრისთვის (მაგალითად, <input type="radio" value="option1">).

# required:
#ეს ატრიბუტი აღნიშნავს, რომ ფორმის ეს ელემენტი უნდა შეივსოს (გაგზავნამდე). თუ მომხმარებელი სცდება ამ ველს და დააჭერს გაგზავნის ღილაკს, ფორმა არ ჩაითვლება valid და გამოჩნდება შეცდომის შეტყობინება. მაგალითად, <input type="text" required> — ამ ველის შევსება აუცილებელია.

# placeholder:
# placeholder ატრიბუტი განსაზღვრავს ტექსტს, რომელიც დაიწერება მინდორში (input field) და გამოფინდება, სანამ მომხმარებელი არ შეყავს მონაცემები. ეს მხოლოდ განამტკიცებს მითითებას, რომელი ინფორმაცია უნდა შეიყვანოს მომხმარებელმა. მაგალითად, <input type="text" placeholder="მოყევით თქვენი სახელი"> — იქ იქნება ტექსტი "მოყევით თქვენი სახელი", სანამ მომხმარებელი არაფერს ჩაწერს.

# id
# id ატრიბუტი იდენტიფიცირებს ელემენტს დოკუმენტში და უზრუნველყოფს უნიკალურობის დაცვას. id მნიშვნელობა უნდა იყოს უნიკალური მთელი HTML დოკუმენტისთვის. ეს ატრიბუტი ხშირად გამოიყენება JavaScript ან CSS-ის გამოყენებისას ელემენტზე წვდომისთვის. მაგალითად, <input type="text" id="username"> — იდენტიფიცირებს ამ ელემენტს როგორც "username".

#for:
# for ატრიბუტი გამოიყენება <label> ელემენტში და ასოცირდება კონკრეტულ ფორმის ელემენტთან (მაგალითად, <input>). მისი მიზანი არის, რომ როცა მომხმარებელი დააჭერს ლეიბელს, იგი აქტიურდება შესაბამისი ფორმის ელემენტზე. მაგალითად, <label for="username">სახელი</label> — ამ ატრიბუტის გამოყენებით, თუ მომხმარებელი დააჭერს "სახელი" ტექსტს, ყურადღება მიექცევა ველს id="username".
