# სია 10 ელემენტით
my_list = ['ა', 'ბ', 'გ', 'დ', 'ე', 'ვ', 'ზ', 'თ', 'ი', 'კ']

# მომხმარებლის შეყვანილი რიცხვი
user_input = input("შეიყვანეთ რიცხვი: ")

try:
    index = int(user_input)  # ვაქცევთ შეყვანილ მნიშვნელობას მთელ რიცხვად
    
    # დადებითი ან ნულის შემთხვევა
    if 0 <= index < len(my_list):
        print(f"ინდექსზე {index} მყოფი ელემენტია: {my_list[index]}")
    
    # უარყოფითი შემთხვევა
    elif (-len(my_list) <= index <= -1):
        print(f"უარყოფითი ინდექსზე {index} მყოფი ელემენტია: {my_list[index]}")
    
    else:
        print("მითითებული რიცხვი სიის ფარგლებს გარეთაა.")

except ValueError:
    print("შეყვანილი მნიშვნელობა არ არის სწორი რიცხვი.")

    
