for i in range(20):
    print("ლუკა ჭანიშვილი")
    print("ლუკა ჭანიშვილი")
    print("ლუკა ჭანიშვილი")
    print("ლუკა ჭანიშვილი")
    print("ლუკა ჭანიშვილი")
    print("ლუკა ჭანიშვილი")
    print("ლუკა ჭანიშვილი")
    print("ლუკა ჭანიშვილი")
    print("ლუკა ჭანიშვილი")
    print("ლუკა ჭანიშვილი")
    print("ლუკა ჭანიშვილი")
    print("ლუკა ჭანიშვილი")
    print("ლუკა ჭანიშვილი")
    print("ლუკა ჭანიშვილი")
    print("ლუკა ჭანიშვილი")
    print("ლუკა ჭანიშვილი")
    print("ლუკა ჭანიშვილი")
    print("ლუკა ჭანიშვილი")
    print("ლუკა ჭანიშვილი")
    print("ლუკა ჭანიშვილი")


    # რიცხვების პირდაპირ შეყვანა
first_number = 2
second_number = 5

# for ციკლით დიაპაზონზე იტერაცია
for i in range(first_number, second_number + 1):
    print(f"რიცხვი {i} - კვადრატი: {i ** 2}")





    # მომხმარებელს სთხოვს შეიყვანოს რიცხვი
n = int(input("შეიყვანეთ რიცხვი: "))

# for ციკლის გამოყენებით დაბეჭდავს კვადრატებს
for i in range(1, n + 1):
    print(f"{i} რიცხვის კვადრატი არის {i ** 2}")